hw4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "sdf"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Alien"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    if @movie.director.nil? || @movie.director.empty?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to root_path
    else
      @similar_movies = Movie.find_movies_with_same_director(@movie)